app/controllers/tasks_controller.rb

SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @task = current_user.tasks.find(params[:id])

SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def edit
    @task = current_user.tasks.find(params[:id])

SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    task = current_user.tasks.find(params[:id])

SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    task = current_user.tasks.find(params[:id])

INSERT INTO "tasks" ("name", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "タスク編集機能実装"], ["description", "編集用のアクション追加、ビューファイル編集"], ["created_at", "2019-08-21 03:14:56.530437"], ["updated_at", "2019-08-21 03:14:56.530437"]]
---
  def create
    @task = current_user.tasks.new(task_params)
    if @task.save