app/controllers/tasks_controller.rb

  def index
    @q = current_user.tasks.ransack(params[:q])
    @tasks = @q.result(distinct: true).page(params[:page])
---
SELECT COUNT(count_column) FROM (SELECT DISTINCT "tasks"."id" AS count_column FROM "tasks" WHERE "tasks"."user_id" = $1 LIMIT $2 OFFSET $3) subquery_for_count  [["user_id", 4], ["LIMIT", 25], ["OFFSET", 0]]
SELECT "tasks".* FROM "tasks" WHERE "tasks"."user_id" = $1 AND "tasks"."id" = $2 LIMIT $3  [["user_id", 3], ["id", 4], ["LIMIT", 1]]

  def update
    @task.update!(task_params)
---
UPDATE "tasks" SET "description" = $1, "updated_at" = $2 WHERE "tasks"."id" = $3  [["description", "編集用のアクション追加、ビューファイル編集。"], ["updated_at", "2019-08-21 03:15:16.170007"], ["id", 2]]

  def create
    @task = current_user.tasks.new(task_params)

    if params[:back].present?
      render :new
      return
    end

    if @task.save
---
INSERT INTO "tasks" ("name", "description", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "tdr"], ["description", "tdt"], ["created_at", "2019-09-04 04:11:12.378610"], ["updated_at", "2019-09-04 04:11:12.378610"], ["user_id", 4]]